app/Controllers/Admin/Dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `reservations`
WHERE `status` = 'paid'
SELECT COUNT(*) AS `numrows`
FROM `reservations`
WHERE `status` = 'pending'
---
    public function index()
    {
        if (session()->get('role') != 'admin') {
            return redirect()->to('/auth/login');
        }

        $ringModel = new RingModel();
        $resModel = new ReservationModel();

        $data = [
            'total_rings' => $ringModel->countAll(),
            'active_reservations' => $resModel->where('status', 'paid')->countAllResults(),
            'pending_reservations' => $resModel->where('status', 'pending')->countAllResults(),