app/Controllers/Admin/Profile.php

    public function index()
    {
        if (session()->get('role') != 'admin') {
            return redirect()->to('/auth/login');
        }

        $userModel = new UserModel();
        $user = $userModel->find(session()->get('id'));
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'

            ];
        }

        if ($userModel->update($userId, $data)) {
---
UPDATE `users` SET `name` = 'Admin', `email` = 'admin@gmail.com', `updated_at` = '2026-08-07 08:32:59'
WHERE `users`.`id` IN ('1')