app/Controllers/Auth.php

    public function attemptLogin()
    {
        $session = session();
        $model = new UserModel();
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $model->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'miculobrichardvictor@gmail.com'
 LIMIT 1