app/Controllers/Profile.php

SELECT *
FROM `users`
WHERE `users`.`id` = '2'
---
    public function index()
    {
        // Check if user is logged in
        if (!session()->get('is_logged_in')) {
            return redirect()->to('/auth/login');
        }

        $userModel = new UserModel();
        $user = $userModel->find(session()->get('id'));

UPDATE `users` SET `name` = 'Customer', `email` = 'customer@gmail.com', `updated_at` = '2026-08-07 08:33:54'
WHERE `users`.`id` IN ('2')
---
            ];
        }

        if ($userModel->update($userId, $data)) {