app/Controllers/Reservations.php

    public function history()
    {
        $model = new ReservationModel();
        $userId = session()->get('id');

        $data['reservations'] = $model->select('reservations.*, rings.name as ring_name, payments.payment_date')
                                      ->join('rings', 'rings.id = reservations.ring_id')
                                      ->join('payments', 'payments.reservation_id = reservations.id', 'left')
                                      ->where('reservations.user_id', $userId)
                                      ->orderBy('reservations.created_at', 'DESC')
                                      ->findAll();
---
SELECT `reservations`.*, `rings`.`name` as `ring_name`, `payments`.`payment_date`
FROM `reservations`
JOIN `rings` ON `rings`.`id` = `reservations`.`ring_id`
LEFT JOIN `payments` ON `payments`.`reservation_id` = `reservations`.`id`
WHERE `reservations`.`user_id` = '2'
ORDER BY `reservations`.`created_at` DESC