app/Controllers/Rings.php

SELECT *
FROM `rings`
WHERE `status` = 'available'
---
    public function index()
    {
        $model = new RingModel();
        // Get all rings available
        $data['rings'] = $model->where('status', 'available')->findAll();